conf/conf.org
#+PROPERTY: header-args :comments yes :results silent

* shortcuts frequently used

| command         | description                                       |
|-----------------+---------------------------------------------------|
| C-S-<backspace> | runs the command kill-whole-line                  |
| C-c M-k         | duplicate-line                                    |
| C-c C-k         | copy-line                                         |
| C-c b           | browse-url                                        |
| C-c r           | browse-at-remote                                  |
| C-x C-q         | Toggles read only mode                            |
| C-c C-SPC       | whitespace-cleanup                                |
| C-x /           | google this                                       |
| M-\             | delete-horizontal-space                           |
| M-/             | dabbrev-expand                                    |
| M-!             | shell-command                                     |
| M-&             | Like M-!, but asynchronous                        |
|-----------------+---------------------------------------------------|
| M-j             | ivy-yank-word                                     |
| C-c k           | counsel-rg                                        |
| C-*             | swiper-thing-at-point                             |
| M-o             | ivy-dispatching-done                              |
| C-M-j           | Exits with the current input instead of candidate |
|-----------------+---------------------------------------------------|
| M-}             | Move forward to end of paragraph                  |
| M-{             | Move backward to start of paragraph               |
|-----------------+---------------------------------------------------|
| C-t             | Transpose characters                              |
| M-t             | Transpose words                                   |
|-----------------+---------------------------------------------------|
| C-x ( and C-x ) | Starts and stops macro recording                  |
| C-x e           | Plays last macro                                  |
|-----------------+---------------------------------------------------|
| C-x 4 d/f/b     | Opens dired/file/buffer in other window           |
| C-x r m/l/b     | Set/List/Jump bookmark                            |
| C-c o           | occur                                             |
| M-o             | ace-window                                        |
| s-t             | treemacs                                          |
| C-c t           | libvterm                                          |
| s-p             | projectile                                        |
| C-x w           | elfeed                                            |
| C-=             | expand-region                                     |
| s-c             | avy-goto-xxx                                      |
|-----------------+---------------------------------------------------|
| C-c e l         | eglot                                             |
| C-c C-r         | eglot-rename                                      |
| C-c C-'         | eglot-code-actions                                |
|                 |                                                   |
| C-M-i           | complete-symbol                                   |
| C-h .           | eldoc-doc-buffer                                  |
| M-?             | xref-find-references                              |
| M-.             | xref-find-definitions                             |
| M-,             | xref-pop-marker-stack                             |
| s-/             | comment-region-or-line                            |
| C-c M-p         | flymake-goto-prev-error                           |
| C-c M-n         | flymake-goto-next-error                           |
|-----------------+---------------------------------------------------|
| Org mode        | TODO                                              |
|-----------------+---------------------------------------------------|

* speed init

[[https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/][reddit]]

#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold 100000000)
#+END_SRC

* use-package

#+BEGIN_SRC emacs-lisp
  (eval-when-compile
    (require 'use-package))
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)

  ;; if you use any :bind variant
  (use-package bind-key
    :ensure t
    :config
    (require 'bind-key))
#+END_SRC

* benchmark-init

find which makes init slow
~(emacs-init-time)~ can get the init time

#+BEGIN_SRC emacs-lisp
  ;; (use-package benchmark-init
  ;;   :ensure t
  ;;   :init
  ;;   (benchmark-init/activate)
  ;;   :config
  ;;   ;; To disable collection of benchmark data after init is done.
  ;;   (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+END_SRC

* diminish

#+BEGIN_SRC emacs-lisp
  ;; (use-package diminish
  ;;   :ensure t
  ;;   )
#+END_SRC

* backup

#+BEGIN_SRC emacs-lisp
  ;; https://www.emacswiki.org/emacs/BackupDirectory
  (setq backup-directory-alist
        `((".*" . "~/.emacs.d/backup/")))
  (setq auto-save-file-name-transforms
        `((".*" "~/.emacs.d/backup/" t)))
#+END_SRC

* replace tab with space
#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq indent-line-function 'insert-tab)
#+END_SRC

* utf-8 encoding

#+BEGIN_SRC emacs-lisp
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+END_SRC

* display time

#+BEGIN_SRC emacs-lisp
  ;; (setq display-time-24hr-format t)
  ;; (setq display-time-format "%H:%M")
  ;; (display-time-mode 1)
#+END_SRC

* yes-or-no

#+BEGIN_SRC emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p) ; yes/no -> y/n
#+END_SRC

* font

visit the link below to download and install font

https://www.jetbrains.com/lp/mono/
https://fonts.google.com/specimen/Ubuntu+Mono

#+BEGIN_SRC emacs-lisp
  (set-frame-font "JetBrains Mono 18" nil t)
  ;; (set-frame-font "Ubuntu Mono 18" nil t)
#+END_SRC

* global ui

#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t) ; hide the welcome screen
  (setq initial-major-mode 'fundamental-mode) ; change *scratch* major mode
  (setq initial-scratch-message "\
  # This buffer is for notes you don't want to save") ; change message in *scratch*
  (menu-bar-mode -1) ; show/hide menu bar
  (tool-bar-mode -1) ; show/hide tool bar
  (scroll-bar-mode -1) ; show/hide scroll bar
  (global-linum-mode -1) ; show/hide line number
  ;; (visual-line-mode 1) ; word wrap
  (global-hl-line-mode 1) ; highlight current line
  (setq column-number-mode t)
#+END_SRC

* transparency

#+BEGIN_SRC emacs-lisp
  ;; (set-frame-parameter (selected-frame) 'alpha '(85 100))
  ;; (add-to-list 'default-frame-alist '(alpha 85 100))
#+END_SRC

* smart-line

#+BEGIN_SRC emacs-lisp
  (defun copy-line (arg)
    "Copy lines (as many as prefix argument) in the kill ring"
    (interactive "p")
    (kill-ring-save (line-beginning-position)
                    (line-beginning-position (+ 1 arg)))
    (message "%d line%s copied" arg (if (= 1 arg) "" "s")))
  ;; optional key binding
  (global-set-key (kbd "C-c C-k")'copy-line)

  (defun duplicate-line()
    (interactive)
    (move-beginning-of-line 1)
    (kill-line)
    (yank)
    (open-line 1)
    (next-line 1)
    (yank))
  (global-set-key (kbd "C-c M-k") 'duplicate-line)

  ;; (defun smart-open-line ()
  ;;   "Insert an empty line after the current line. Position the cursor at its beginning, according to the current mode."
  ;;   (interactive)
  ;;   (move-end-of-line nil)
  ;;   (newline-and-indent))
  ;; (defun smart-open-line-above ()
  ;;   "Insert an empty line above the current line. Position the cursor at it's beginning, according to the current mode."
  ;;   (interactive)
  ;;   (move-beginning-of-line nil)
  ;;   (newline-and-indent)
  ;;   (forward-line -1)
  ;;   (indent-according-to-mode))
  ;; (global-set-key (kbd "s-<return>") 'smart-open-line)
  ;; (global-set-key (kbd "s-S-<return>") 'smart-open-line-above)

  ;; (defun move-below-line-up ()
  ;;   "Join the current line with the next line."
  ;;   (interactive)
  ;;   (delete-indentation 1))
  ;; (global-set-key (kbd "s-j") 'move-below-line-up)

  ;; (global-set-key (kbd "C-M-l") 'goto-line)
#+END_SRC

* browse-at-remote

#+begin_src emacs-lisp
  (use-package browse-at-remote
    :ensure t
    :bind (("C-c r" . 'browse-at-remote)))
#+end_src
* comment code

#+BEGIN_SRC emacs-lisp
  (defun comment-region-or-line ()
    "Comments or uncomments the region or the current line if there's no active region."
    (interactive)
    (let (beg end)
      (if (region-active-p)
          (setq beg (region-beginning) end (region-end))
        (setq beg (line-beginning-position) end (line-end-position)))
      (comment-or-uncomment-region beg end)))

  (global-set-key (kbd "s-/") 'comment-region-or-line)
#+END_SRC

* beacon

#+BEGIN_SRC emacs-lisp
    ;; https://github.com/Malabarba/beacon
  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1)
    (setq beacon-blink-duration 0.5)
    ;; (setq beacon-color "green")
    )
#+END_SRC

