conf/conf.el
;; [[file:conf.org::*speed init][speed init:1]]
(setq gc-cons-threshold 100000000)
;; speed init:1 ends here

;; [[file:conf.org::*use-package][use-package:1]]
(eval-when-compile
  (require 'use-package))
(require 'use-package-ensure)
(setq use-package-always-ensure t)

;; if you use any :bind variant
(use-package bind-key
  :ensure t
  :config
  (require 'bind-key))
;; use-package:1 ends here

;; [[file:conf.org::*benchmark-init][benchmark-init:1]]
;; (use-package benchmark-init
;;   :ensure t
;;   :init
;;   (benchmark-init/activate)
;;   :config
;;   ;; To disable collection of benchmark data after init is done.
;;   (add-hook 'after-init-hook 'benchmark-init/deactivate))
;; benchmark-init:1 ends here

;; [[file:conf.org::*diminish][diminish:1]]
;; (use-package diminish
;;   :ensure t
;;   )
;; diminish:1 ends here

;; [[file:conf.org::*backup][backup:1]]
;; https://www.emacswiki.org/emacs/BackupDirectory
(setq backup-directory-alist
      `((".*" . "~/.emacs.d/backup/")))
(setq auto-save-file-name-transforms
      `((".*" "~/.emacs.d/backup/" t)))
;; backup:1 ends here

;; [[file:conf.org::*replace tab with space][replace tab with space:1]]
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)
;; replace tab with space:1 ends here

;; [[file:conf.org::*utf-8 encoding][utf-8 encoding:1]]
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
;; utf-8 encoding:1 ends here

;; [[file:conf.org::*display time][display time:1]]
;; (setq display-time-24hr-format t)
;; (setq display-time-format "%H:%M")
;; (display-time-mode 1)
;; display time:1 ends here

;; [[file:conf.org::*yes-or-no][yes-or-no:1]]
(fset 'yes-or-no-p 'y-or-n-p) ; yes/no -> y/n
;; yes-or-no:1 ends here

;; [[file:conf.org::*font][font:1]]
(set-frame-font "JetBrains Mono 18" nil t)
;; (set-frame-font "Ubuntu Mono 18" nil t)
;; font:1 ends here

;; [[file:conf.org::*global ui][global ui:1]]
(setq inhibit-startup-screen t) ; hide the welcome screen
(setq initial-major-mode 'fundamental-mode) ; change *scratch* major mode
(setq initial-scratch-message "\
# This buffer is for notes you don't want to save") ; change message in *scratch*
(menu-bar-mode -1) ; show/hide menu bar
(tool-bar-mode -1) ; show/hide tool bar
(scroll-bar-mode -1) ; show/hide scroll bar
(global-linum-mode -1) ; show/hide line number
;; (visual-line-mode 1) ; word wrap
(global-hl-line-mode 1) ; highlight current line
(setq column-number-mode t)
;; global ui:1 ends here

;; [[file:conf.org::*transparency][transparency:1]]
;; (set-frame-parameter (selected-frame) 'alpha '(85 100))
;; (add-to-list 'default-frame-alist '(alpha 85 100))
;; transparency:1 ends here

;; [[file:conf.org::*smart-line][smart-line:1]]
(defun copy-line (arg)
  "Copy lines (as many as prefix argument) in the kill ring"
  (interactive "p")
  (kill-ring-save (line-beginning-position)
                  (line-beginning-position (+ 1 arg)))
  (message "%d line%s copied" arg (if (= 1 arg) "" "s")))
;; optional key binding
(global-set-key (kbd "C-c C-k")'copy-line)

(defun duplicate-line()
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank))
(global-set-key (kbd "C-c M-k") 'duplicate-line)

;; (defun smart-open-line ()
;;   "Insert an empty line after the current line. Position the cursor at its beginning, according to the current mode."
;;   (interactive)
;;   (move-end-of-line nil)
;;   (newline-and-indent))
;; (defun smart-open-line-above ()
;;   "Insert an empty line above the current line. Position the cursor at it's beginning, according to the current mode."
;;   (interactive)
;;   (move-beginning-of-line nil)
;;   (newline-and-indent)
;;   (forward-line -1)
;;   (indent-according-to-mode))
;; (global-set-key (kbd "s-<return>") 'smart-open-line)
;; (global-set-key (kbd "s-S-<return>") 'smart-open-line-above)

;; (defun move-below-line-up ()
;;   "Join the current line with the next line."
;;   (interactive)
;;   (delete-indentation 1))
;; (global-set-key (kbd "s-j") 'move-below-line-up)

;; (global-set-key (kbd "C-M-l") 'goto-line)
;; smart-line:1 ends here

;; [[file:conf.org::*browse-at-remote][browse-at-remote:1]]
(use-package browse-at-remote
  :ensure t
  :bind (("C-c r" . 'browse-at-remote)))
;; browse-at-remote:1 ends here

;; [[file:conf.org::*comment code][comment code:1]]
(defun comment-region-or-line ()
  "Comments or uncomments the region or the current line if there's no active region."
  (interactive)
  (let (beg end)
    (if (region-active-p)
        (setq beg (region-beginning) end (region-end))
      (setq beg (line-beginning-position) end (line-end-position)))
    (comment-or-uncomment-region beg end)))

(global-set-key (kbd "s-/") 'comment-region-or-line)
;; comment code:1 ends here

;; [[file:conf.org::*beacon][beacon:1]]
;; https://github.com/Malabarba/beacon
(use-package beacon
  :ensure t
  :config
  (beacon-mode 1)
  (setq beacon-blink-duration 0.5)
  ;; (setq beacon-color "green")
  )
;; beacon:1 ends here
