conf/conf.org
* theme

#+BEGIN_SRC emacs-lisp
  ;; (use-package doom-themes
  ;;   :ensure t
  ;;   :config

  ;;   ;; Global settings (defaults)
  ;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
  ;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;;   (load-theme 'doom-one t)

  ;;   ;; Enable flashing mode-line on errors
  ;;   (doom-themes-visual-bell-config)

  ;;   ;; Corrects (and improves) org-mode's native fontification.
  ;;   (doom-themes-org-config))


  ;; M-x color-theme-sanityinc-tomorrow-day
  ;; M-x color-theme-sanityinc-tomorrow-night
  ;; M-x color-theme-sanityinc-tomorrow-blue
  ;; M-x color-theme-sanityinc-tomorrow-bright
  ;; M-x color-theme-sanityinc-tomorrow-eighties
  ;; (use-package color-theme-sanityinc-tomorrow
  ;;   :ensure t
  ;;   :config
  ;;   (require 'color-theme-sanityinc-tomorrow))

  ;; (use-package dracula-theme
  ;;   :ensure t
  ;;   :config
  ;;   (load-theme 'dracula t))

  ;; (use-package zenburn-theme
  ;;   :ensure t
  ;;   :config
  ;;   (load-theme 'zenburn t))

  ;; (use-package solarized-theme
  ;;   :ensure t
  ;;   :config
  ;;   ;; (load-theme 'solarized-light t)
  ;;   (load-theme 'solarized-dark t)
  ;;   )

  ;; (use-package spacemacs-theme
  ;;   :defer t
  ;;   :init (load-theme 'spacemacs-dark t))

  (use-package nord-theme
    :ensure t
    :config
    ;; (add-to-list 'custom-theme-load-path
    ;;              (expand-file-name "~/.emacs.d/themes/"))
    (load-theme 'nord t))
#+END_SRC

* mode line

#+BEGIN_SRC emacs-lisp
  ;; (use-package powerline
  ;;   :ensure t
  ;;   :config
  ;;   (powerline-default-theme)
  ;;   ;; (powerline-center-theme)
  ;;   ;; (powerline-center-evil-theme)
  ;;   ;; (powerline-vim-theme)
  ;;   ;; (powerline-nano-theme)
  ;;   )
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package spaceline
    :ensure t
    :config
    (require 'spaceline-config)
    (spaceline-emacs-theme))
#+END_SRC

#+begin_src elisp
  ;; (use-package all-the-icons
  ;;   :ensure t)

  ;; (use-package doom-modeline
  ;;   :ensure t
  ;;   :hook (after-init . doom-modeline-mode))
#+end_src

* exec-path-from-shell

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :defer 5
    :config

    ;; (setq exec-path-from-shell-arguments nil)

    (when (memq window-system '(mac ns x))
      (dolist (var '("https_proxy" "http_proxy" "all_proxy" "GOPATH"))
        (add-to-list 'exec-path-from-shell-variables var))

      (exec-path-from-shell-initialize)))
#+END_SRC

* yasnippet

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :defer 5
    :config
    (yas-reload-all)
    (setq yas-wrap-around-region t)
    :hook (('prog-mode     . 'yas-minor-mode)
           ('org-mode      . 'yas-minor-mode)
           ('LaTeX-mode    . 'yas-minor-mode)
           ('markdown-mode . 'yas-minor-mode)))

  (use-package yasnippet-snippets
    :ensure t
    :after yasnippet)
#+END_SRC

* recentf

#+BEGIN_SRC emacs-lisp
  (use-package recentf
    :ensure t
    :config
    (recentf-mode 1)
    (setq recentf-max-saved-items 200
          recentf-max-menu-items 15)
    (run-at-time nil (* 5 60) 'recentf-save-list))
#+END_SRC

* projectile

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :config
    (projectile-mode +1)
    (setq projectile-completion-system 'ivy)
    (setq projectile-dynamic-mode-line nil)
    :bind-keymap
    ("s-p" . projectile-command-map)
    ;; ("C-c p" . projectile-command-map)
    )

  ;; (use-package helm-projectile
  ;;   :ensure t
  ;;   :config
  ;;   (projectile-global-mode 1)
  ;;   (helm-projectile-on)
  ;;   ;; (setq projectile-completion-system 'helm)
  ;;   (setq projectile-switch-project-action 'helm-projectile)
  ;;   )
#+END_SRC

* ivy

- [[https://oremacs.com/swiper][ivy user manual]]
- [[https://writequit.org/denver-emacs/presentations/2017-04-11-ivy.html][ivy demo]]

| Key        | Command                 | Description                                    |
|------------+-------------------------+------------------------------------------------|
| M-n        | ivy-next-line           | Next line                                      |
| M-p        | ivy-previous-line       | Previous line                                  |
| M-<        | ivy-beginning-of-buffer | Beginning of the Ivy minibuffer                |
| M->        | ivy-end-of-buffer       | End of the Ivy minibuffer                      |
| C-v        | ivy-scroll-up-command   | Page up by one Ivy buffer size                 |
| M-v        | ivy-scroll-down-command | Page down by one Ivy buffer size               |
| C-m or RET | ivy-done                | Calls the default action                       |
| ~C-M-m~      | ivy-call                | Calls the default action, keeps Ivy open       |
| ~M-o~        | ivy-dispatching-done    | Displays the available actions                 |
| ~C-M-o~      | ivy-dispacthing-call    | Displays available actions, keeps Ivy open     |
| C-'        | ivy-avy                 | Uses Avy to select candidates                  |
| TAB        | ivy-partial-or-done     | Tab completion, repeated presses may call done |
|            | ivy-resume              | Restart Ivy before last action                 |

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :ensure t
    :config
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    (setq ivy-count-format "(%d/%d) ")
    (setq ivy-wrap t)
    :bind
    (("C-s"     . 'swiper-isearch)
     ("M-x"     . 'counsel-M-x)
     ("M-y"     . 'counsel-yank-pop)
     ("C-x C-f" . 'counsel-find-file)
     ("C-x b"   . 'ivy-switch-buffer)

     ;; ("M-n" . ivy-next-history-element)
     ;; ("M-p" . ivy-previous-history-element)
     ;; ("M-i" . ivy-insert-current)
     ("M-j" . 'ivy-yank-word) ;; C-s M-j this will search symbol at point

     ;; ("C-c C-r" . 'ivy-resume)
     ;; ("C-c v"   . 'ivy-push-view)
     ;; ("C-c V"   . 'ivy-pop-view)
     ("C-c k"   . 'counsel-rg)
     ;; ("C-c l"   . 'counsel-locate)
     ;; ("C-c g"   . 'counsel-git)
     ;; ("C-c j"   . 'counsel-git-grep)
     ;; ("C-S-o"   . 'counsel-rhythmbox)
     ("C-*"     . 'swiper-thing-at-point)
     ))


  (use-package counsel-tramp
    :ensure t
    :after counsel)
#+END_SRC

* multiple cursor

#+BEGIN_SRC emacs-lisp
  (use-package multiple-cursors
    :ensure t
    :defer 5
    :bind
    (("C-x C-v" . 'mc/edit-lines)
     ("C->" . 'mc/mark-next-like-this)
     ("C-<" . 'mc/mark-previous-like-this)
     ("C-x C-a" . 'mc/mark-all-like-this)))
#+END_SRC

* magit & forge

** cherry pick

[[https://emacs.stackexchange.com/questions/10611/how-to-easily-cherry-pick-with-magit][cherry pick with magit]]
[[https://www.emacswiki.org/emacs/MagitCherryPick][magit cherry pick]]


- ~M-x magit-status~ to enter open a Magit buffer
- ~b v~ to list current branches
- select branch to receive patch, RET to checkout
- ~l rl~ to list patches from this branch to the branch with the cherries (or l rL, long diff)
- select the patch to cherry-pick
- ~A~ to bring the patch onto the current branch

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :bind (("C-x g"   . 'magit-status)
           ("C-c g"   . 'magit-dispatch-popup)
           ("C-c M-g" . 'magit-file-dispatch)))

  ;; (use-package forge
  ;;   :ensure t
  ;;   :after magit)
#+END_SRC

* ace window

#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t
    :bind (("M-o" . 'ace-window)))
#+END_SRC

* which key

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode))
#+END_SRC

* neotree

|---------+-----------------------------------------------------------------|
| n       | next line, p previous line.                                     |
| SPC     | or RET or TAB Open current item if it is a file.                |
| U       | Go up a directory                                               |
| g       | Refresh                                                         |
| A       | Maximize/Minimize the NeoTree Window                            |
| H       | Toggle display hidden files                                     |
| <       | beginning-of-buffer                                             |
| >       | end-of-buffer                                                   |
| ?       | describe-mode                                                   |
|---------+-----------------------------------------------------------------|
| C-c C-n | Create a file or create a directory if filename ends with a ‘/’ |
| C-c C-d | Delete a file or a directory.                                   |
| C-c C-r | Rename a file or a directory.                                   |
| C-c C-c | Change the root directory.                                      |
| C-c C-p | Copy a file or a directory.                                     |
| C-c C-a | neotree-collapse-all                                            |

#+BEGIN_SRC emacs-lisp
  ;; (use-package neotree
  ;;   :ensure t
  ;;   :bind
  ;;   (("s-t" . 'neotree-toggle))
  ;;   :config
  ;;   (setq neo-smart-open t)
  ;;   (setq neo-theme 'arrow))
#+END_SRC

