conf/conf.el

;; [[file:conf.org::*theme][theme:1]]
;; (use-package doom-themes
;;   :ensure t
;;   :config

;;   ;; Global settings (defaults)
;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
;;   (load-theme 'doom-one t)

;;   ;; Enable flashing mode-line on errors
;;   (doom-themes-visual-bell-config)

;;   ;; Corrects (and improves) org-mode's native fontification.
;;   (doom-themes-org-config))


;; M-x color-theme-sanityinc-tomorrow-day
;; M-x color-theme-sanityinc-tomorrow-night
;; M-x color-theme-sanityinc-tomorrow-blue
;; M-x color-theme-sanityinc-tomorrow-bright
;; M-x color-theme-sanityinc-tomorrow-eighties
;; (use-package color-theme-sanityinc-tomorrow
;;   :ensure t
;;   :config
;;   (require 'color-theme-sanityinc-tomorrow))

;; (use-package dracula-theme
;;   :ensure t
;;   :config
;;   (load-theme 'dracula t))

;; (use-package zenburn-theme
;;   :ensure t
;;   :config
;;   (load-theme 'zenburn t))

;; (use-package solarized-theme
;;   :ensure t
;;   :config
;;   ;; (load-theme 'solarized-light t)
;;   (load-theme 'solarized-dark t)
;;   )

;; (use-package spacemacs-theme
;;   :defer t
;;   :init (load-theme 'spacemacs-dark t))

(use-package nord-theme
  :ensure t
  :config
  ;; (add-to-list 'custom-theme-load-path
  ;;              (expand-file-name "~/.emacs.d/themes/"))
  (load-theme 'nord t))
;; theme:1 ends here

;; [[file:conf.org::*mode line][mode line:1]]
;; (use-package powerline
;;   :ensure t
;;   :config
;;   (powerline-default-theme)
;;   ;; (powerline-center-theme)
;;   ;; (powerline-center-evil-theme)
;;   ;; (powerline-vim-theme)
;;   ;; (powerline-nano-theme)
;;   )
;; mode line:1 ends here

;; [[file:conf.org::*mode line][mode line:2]]
(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
  (spaceline-emacs-theme))
;; mode line:2 ends here

;; [[file:conf.org::*mode line][mode line:3]]
;; (use-package all-the-icons
;;   :ensure t)

;; (use-package doom-modeline
;;   :ensure t
;;   :hook (after-init . doom-modeline-mode))
;; mode line:3 ends here

;; [[file:conf.org::*exec-path-from-shell][exec-path-from-shell:1]]
(use-package exec-path-from-shell
  :ensure t
  :defer 5
  :config

  ;; (setq exec-path-from-shell-arguments nil)

  (when (memq window-system '(mac ns x))
    (dolist (var '("https_proxy" "http_proxy" "all_proxy" "GOPATH"))
      (add-to-list 'exec-path-from-shell-variables var))

    (exec-path-from-shell-initialize)))
;; exec-path-from-shell:1 ends here

;; [[file:conf.org::*yasnippet][yasnippet:1]]
(use-package yasnippet
  :ensure t
  :defer 5
  :config
  (yas-reload-all)
  (setq yas-wrap-around-region t)
  :hook (('prog-mode     . 'yas-minor-mode)
         ('org-mode      . 'yas-minor-mode)
         ('LaTeX-mode    . 'yas-minor-mode)
         ('markdown-mode . 'yas-minor-mode)))

(use-package yasnippet-snippets
  :ensure t
  :after yasnippet)
;; yasnippet:1 ends here

;; [[file:conf.org::*recentf][recentf:1]]
(use-package recentf
  :ensure t
  :config
  (recentf-mode 1)
  (setq recentf-max-saved-items 200
        recentf-max-menu-items 15)
  (run-at-time nil (* 5 60) 'recentf-save-list))
;; recentf:1 ends here

;; [[file:conf.org::*projectile][projectile:1]]
(use-package projectile
  :ensure t
  :config
  (projectile-mode +1)
  (setq projectile-completion-system 'ivy)
  (setq projectile-dynamic-mode-line nil)
  :bind-keymap
  ("s-p" . projectile-command-map)
  ;; ("C-c p" . projectile-command-map)
  )

;; (use-package helm-projectile
;;   :ensure t
;;   :config
;;   (projectile-global-mode 1)
;;   (helm-projectile-on)
;;   ;; (setq projectile-completion-system 'helm)
;;   (setq projectile-switch-project-action 'helm-projectile)
;;   )
;; projectile:1 ends here

;; [[file:conf.org::*ivy][ivy:1]]
(use-package counsel
  :ensure t
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-wrap t)
  :bind
  (("C-s"     . 'swiper-isearch)
   ("M-x"     . 'counsel-M-x)
   ("M-y"     . 'counsel-yank-pop)
   ("C-x C-f" . 'counsel-find-file)
   ("C-x b"   . 'ivy-switch-buffer)

   ;; ("M-n" . ivy-next-history-element)
   ;; ("M-p" . ivy-previous-history-element)
   ;; ("M-i" . ivy-insert-current)
   ("M-j" . 'ivy-yank-word) ;; C-s M-j this will search symbol at point

   ;; ("C-c C-r" . 'ivy-resume)
   ;; ("C-c v"   . 'ivy-push-view)
   ;; ("C-c V"   . 'ivy-pop-view)
   ("C-c k"   . 'counsel-rg)
   ;; ("C-c l"   . 'counsel-locate)
   ;; ("C-c g"   . 'counsel-git)
   ;; ("C-c j"   . 'counsel-git-grep)
   ;; ("C-S-o"   . 'counsel-rhythmbox)
   ("C-*"     . 'swiper-thing-at-point)
   ))


(use-package counsel-tramp
  :ensure t
  :after counsel)
;; ivy:1 ends here

;; [[file:conf.org::*multiple cursor][multiple cursor:1]]
(use-package multiple-cursors
  :ensure t
  :defer 5
  :bind
  (("C-x C-v" . 'mc/edit-lines)
   ("C->" . 'mc/mark-next-like-this)
   ("C-<" . 'mc/mark-previous-like-this)
   ("C-x C-a" . 'mc/mark-all-like-this)))
;; multiple cursor:1 ends here

;; [[file:conf.org::*cherry pick][cherry pick:1]]
(use-package magit
  :ensure t
  :bind (("C-x g"   . 'magit-status)
         ("C-c g"   . 'magit-dispatch-popup)
         ("C-c M-g" . 'magit-file-dispatch)))

;; (use-package forge
;;   :ensure t
;;   :after magit)
;; cherry pick:1 ends here

;; [[file:conf.org::*ace window][ace window:1]]
(use-package ace-window
  :ensure t
  :bind (("M-o" . 'ace-window)))
;; ace window:1 ends here

;; [[file:conf.org::*which key][which key:1]]
(use-package which-key
  :ensure t
  :config
  (which-key-mode))
;; which key:1 ends here

;; [[file:conf.org::*neotree][neotree:1]]
;; (use-package neotree
;;   :ensure t
;;   :bind
;;   (("s-t" . 'neotree-toggle))
;;   :config
;;   (setq neo-smart-open t)
;;   (setq neo-theme 'arrow))
;; neotree:1 ends here
