conf/conf.org
* paredit

#+BEGIN_SRC emacs-lisp
  (use-package paredit
    :ensure t
    :hook
    (('cider-repl-mode          . 'enable-paredit-mode)
     ('cider-mode               . 'enable-paredit-mode)
     ('clojure-mode             . 'enable-paredit-mode)
     ('emacs-lisp-mode          . 'enable-paredit-mode)
     ('ielm-mode                . 'enable-paredit-mode)
     ('lisp-mode                . 'enable-paredit-mode)
     ('lisp-interaction-mode    . 'enable-paredit-mode)
     ('scheme-mode              . 'enable-paredit-mode)
     ('haskell-interactive-mode . 'enable-paredit-mode)))

  (global-set-key (kbd "C-s-<right>") 'paredit-forward-slurp-sexp)
  (global-set-key (kbd "C-s-<left>") 'paredit-forward-barf-sexp)
#+END_SRC

* smartparens

#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :ensure t
    :hook
    (('prog-mode                . 'smartparens-mode)
     ('LaTeX-mode               . 'smartparens-mode)
     ('eshell-mode              . 'smartparens-mode)
     ('cider-mode               . 'smartparens-mode)
     ('cider-repl-mode          . 'smartparens-mode))

    :bind
    (("C-M-a"     . 'sp-beginning-of-sexp)
     ("C-M-e"     . 'sp-end-of-sexp)
     ("C-M-f"     . 'sp-forward-sexp)
     ("C-M-b"     . 'sp-backward-sexp)
     ("C-M-n"     . 'sp-next-sexp)
     ("C-M-p"     . 'sp-previous-sexp)
     ("C-S-f"     . 'sp-forward-symbol)
     ("C-S-b"     . 'sp-backward-symbol)
     ("C-M-k"     . 'sp-kill-sexp)
     ("C-M-w"     . 'sp-copy-sexp)
     ("C-k"       . 'sp-kill-hybrid-sexp)
     ("M-k"       . 'sp-backward-kill-sexp)))
#+END_SRC

* rainbow

#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook ('prog-mode . 'rainbow-delimiters-mode))
#+END_SRC

* coding

** eglot

#+begin_src elisp
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; for Go
    ;; https://github.com/golang/tools/blob/master/gopls/doc/emacs.md#configuring-eglot
  (defun project-find-go-module (dir)
    (when-let ((root (locate-dominating-file dir "go.mod")))
      (cons 'go-module root)))

  (defun eglot-format-buffer-on-save ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t))

  (cl-defmethod project-root ((project (head go-module)))
    (cdr project))


    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package eglot
    :ensure t
    :config
    ;; for Go
    (add-hook 'project-find-functions #'project-find-go-module)
    (add-hook 'go-mode-hook #'eglot-format-buffer-on-save)

    :bind
    (("C-c e l" . 'eglot)
     ("C-c C-r" . 'eglot-rename)
     ("C-c C-'" . 'eglot-code-actions)

     ("C-c f p" . 'flymake-goto-prev-error)
     ("C-c f n" . 'flymake-goto-next-error)
     ("C-c f b" . 'flymake-show-buffer-diagnostics)
     ("C-c f s" . 'flymake-show-project-diagnostics)))
#+end_src

** clojure and cider

#+BEGIN_SRC emacs-lisp
  (use-package clojure-mode
    :ensure t
    :defer 5
    :hook (('clojure-mode . 'eldoc-mode))
    :config
    (setq align-arguments t)
    ;; compojure indentation
    ;; (define-clojure-indent
    ;;   (defroutes 'defun)
    ;;   (GET 2)
    ;;   (POST 2)
    ;;   (PUT 2)
    ;;   (DELETE 2)
    ;;   (HEAD 2)
    ;;   (ANY 2)
    ;;   (OPTIONS 2)
    ;;   (PATCH 2)
    ;;   (rfn 2)
    ;;   (let-routes 1)
    ;;   (context 2))
    )

  (use-package cider
    :ensure t
    :after clojure-mode
    :config
    ;; go right to the REPL buffer when it's finished connecting
    (setq cider-repl-pop-to-buffer-on-connect t)

    ;; When there's a cider error, show its buffer and switch to it
    (setq cider-show-error-buffer t)
    (setq cider-auto-select-error-buffer t)
    (setq cider-test-show-report-on-success t)

    ;; Where to store the cider history.
    (setq cider-repl-history-file "~/.emacs.d/cider-history")

    ;; Wrap when navigating history.
    (setq cider-repl-wrap-history t)

    ;; turn off eldoc displayed when the cursor is over code
    (setq cider-prompt-for-symbol nil)

    ;; Just save without prompting, C-c C-k
    (setq cider-save-file-on-load t)

    ;; evaluate code in Clojure files, display result overlay to be font-locked
    (setq cider-overlays-use-font-lock t)

    (setq cider-refresh-show-log-buffer t)

    (setq cider-repl-tab-command #'indent-for-tab-command)

    (setq cider-eldoc-display-for-symbol-at-point nil)
    (setq cider-repl-display-help-banner nil))
#+END_SRC

** python

#+BEGIN_SRC emacs-lisp
#+END_SRC

** go

#+begin_src emacs-lisp
  (use-package go-mode
    :ensure t
    :defer 5
    :bind
    (("C-c C-c C-t" . 'go-test-current-test)
     ("C-c C-c C-f" . 'go-test-current-file)))
#+end_src

** rust

#+BEGIN_SRC emacs-lisp
  (use-package rust-mode
    :ensure t
    :defer 5
    :config
    (setq rust-format-on-save t))
#+END_SRC

** elixir

#+BEGIN_SRC emacs-lisp
#+END_SRC

** haskell

* company

#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :hook ('prog-mode . 'global-company-mode)
    :config
    (company-tng-configure-default)
    (setq company-idle-delay 0.5)
    (setq company-minimum-prefix-length 3)
    (setq company-selection-wrap-around t)
    (setq company-tooltip-align-annotations t))
#+END_SRC

* expand region

#+BEGIN_SRC emacs-lisp
  ;; C-- C-= : contract the region
  (use-package expand-region
    :ensure t
    :defer 5
    :bind
    ("C-=" . 'er/expand-region))
#+END_SRC

* rest client

| C-c C-c | runs the query under the cursor                |
| C-c C-r | same but doesn't do anything with the response |
| C-c C-v | same but doesn't switch focus to other window  |
| TAB     | hide/show current request body                 |
| C-c C-a | show all collapsed regions                     |

#+BEGIN_SRC emacs-lisp
  ;; (use-package restclient
  ;;   :ensure t
  ;;   :defer 5
  ;;   :mode ("\\.http\\'" . 'restclient-mode))

  ;; (use-package ob-restclient
  ;;   :ensure t
  ;;   :defer 5
  ;;   :after restclient)
#+END_SRC

* org

** narrow

| C-x n        | narrow pretix                                                                                       |
| C-x n s      | narrow subtree                                                                                      |
| C-x n w      | widen                                                                                               |

#+BEGIN_SRC emacs-lisp
  (defun my/org-narrow-forward ()
    "Move to the next subtree at same level, and narrow to it."
    (interactive)
    (widen)
    (org-forward-heading-same-level 1)
    (org-narrow-to-subtree))

  (defun my/org-narrow-backward ()
    "Move to the next subtree at same level, and narrow to it."
    (interactive)
    (widen)
    (org-backward-heading-same-level 1)
    (org-narrow-to-subtree))
#+END_SRC

** normal

|--------------+-----------------------------------------------------------------------------------------------------|
| C-u C-c C-c  | make plain list to checkbox list. cursor at the beginning will make the whole list to checkbox list |
| M-S-RET      | will add a new item with a checkbox                                                                 |
|--------------+-----------------------------------------------------------------------------------------------------|
| C-c C-x p    | Set a property. This prompts for a property name and a value                                        |
|--------------+-----------------------------------------------------------------------------------------------------|
| C-c C-x f    | add The footnote                                                                                    |
| C-c C-c      | Jump between definition and reference                                                               |
|--------------+-----------------------------------------------------------------------------------------------------|
| M-up/down    | move up/down current subtree                                                                        |
| M-left/right | Promote/demote current subtree                                                                      |
|--------------+-----------------------------------------------------------------------------------------------------|
| C-c /        | sparse tree                                                                                         |
|--------------+-----------------------------------------------------------------------------------------------------|
| C-c C-t      | Rotate the TODO state of the current item among (unmarked) -> TODO -> DONE -> (unmarked)            |
| S-M-RET      | insert TODO                                                                                         |
|--------------+-----------------------------------------------------------------------------------------------------|
| C-c C-q      | add tag                                                                                             |
|--------------+-----------------------------------------------------------------------------------------------------|
| M-TAB        | completion                                                                                          |

