conf/conf.org
** date, schedule

- normal timestamp
  < 2006-11-01 Wed 19:15 >
- normal timestamp with repeater
  < 2007-05-16 Wed 12:30 +1w >
- timestamp range
  < 2004-08-23 Mon >--< 2004-08-26 Thu >
- timestamp won't be included in agenda
  [ 2006-11-01 Wed ]


|----------------+----------------------------------------------------------------------------------|
| C-c .          | Prompt for a date and insert a corresponding timestamp                           |
| C-c !          | but insert an inactive timestamp that will not cause an agenda entry             |
| C-c C-d        | Insert ‘DEADLINE’ keyword along with a stamp in the line following the headline  |
| C-c C-s        | Insert ‘SCHEDULED’ keyword along with a stamp in the line following the headline |
|----------------+----------------------------------------------------------------------------------|
| M-S-left/right | inc/dec month                                                                    |
| S-left/right   | inc/dec day                                                                      |
| S-up/down      | Change the item under the cursor in a timestamp                                  |
|----------------+----------------------------------------------------------------------------------|

** agenda
|-------+--------------------------------------------------------------------|
| C-c [ | Add current file to the list of agenda files.                      |
| C-c ] | Remove current file from the list of agenda files.                 |
| C-,   | Cycle through agenda file list, visiting one file after the other. |
| C-c a | agenda view                                                        |
|-------+--------------------------------------------------------------------|

** config

#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure t
    :defer 5

    ;; :bind
    ;; (("C-c l"   . 'org-store-link)
    ;;  ("C-c a"   . 'org-agenda)
    ;;  ("C-c b"   . 'org-switchb)
    ;;  ("C-c c"   . 'org-capture)
    ;;  ("C-x n f" . 'my/org-narrow-forward)
    ;;  ("C-x n b" . 'my/org-narrow-backward)
    ;;  ("C-c M-." . 'org-open-at-point)
    ;;  ("C-c M-," . 'org-mark-ring-goto))

    :config
    ;; (org-babel-do-load-languages
    ;;  'org-babel-load-languages
    ;;  '((restclient . t)
    ;;    (clojure    . t)
    ;;    (python     . t)
    ;;    (latex      . t)
    ;;    (shell      . t)))

    (setq org-startup-truncated nil)
    ;; (setq org-link-frame-setup '((file . find-file)))
    (add-to-list 'org-structure-template-alist
                 '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
    (setq org-html-checkbox-type 'html)
    (setq org-log-done 'time)
    (setq org-hide-emphasis-markers t)
    (setq org-image-actual-width nil)
    (setq org-default-notes-file "~/.emacs.d/notes.org")
    (setq org-todo-keywords
          '((sequence "TODO" "DOING" "|" "DONE" "CANCEL"))))

  ;; (use-package org-bullets
  ;;   :ensure t
  ;;   :defer 5
  ;;   :hook ('org-mode . 'org-bullets-mode)
  ;;   ;; :config
  ;;   ;; (setq org-bullets-bullet-list '("⓪" "①" "②" "③" "④" "⑤" "⑥" "⑦" "⑧" "⑨"))
  ;;   :after org)

  ;; (use-package htmlize
  ;;   :ensure t
  ;;   :defer 5
  ;;   :after org)

  ;; (use-package toc-org
  ;;   :ensure t
  ;;   :defer 5
  ;;   :after org
  ;;   :hook ('org-mode . 'toc-org-mode))

  ;; (use-package ox-gfm
  ;;   :ensure t
  ;;   :defer 5
  ;;   :after org)

  ;; ;; https://github.com/yjwen/org-reveal
  ;; ;;
  ;; ;; Available themes can be found in “css/theme/” in the reveal.js directory. black|league|night|simple|solarized|beige|blood|moon|serif|sky|white
  ;; ;; Available transitions are: default|cube|page|concave|zoom|linear|fade|none.
  ;; (use-package ox-reveal
  ;;   :ensure t
  ;;   :defer 5
  ;;   :after org
  ;;   :config
  ;;   (setq org-reveal-mathjax t)
  ;;   (setq org-reveal-root "https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/")
  ;;   ;; (setq org-reveal-root "/home/yuanbo/workspace/github.com/reveal.js")
  ;;   )
#+END_SRC

* abbrev

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Defining-Abbrevs.html][define abbrevs]]
[[https://www.emacswiki.org/emacs/AbbrevMode][abbrev mode]]
[[https://wilkesley.org/~ian/xah/emacs/emacs_abbrev_mode.html][abbrev mode tutorial]]

| C-x a i g                                             | add-inverse-global                                           |
| C-x a i l                                             | add-inverse-local                                            |
| C-x a g                                               | add-global-abbrev                                            |
| C-u 3 C-x a g                                         | how many words before point should be taken as the expansion |
| C-x a l                                               | add-mode-abbrev                                              |
| M-x define-global-abbrev <RET> abbrev <RET> exp <RET> | Define abbrev as an abbrev expanding into exp.               |

#+BEGIN_SRC emacs-lisp
  (setq-default abbrev-mode t)
  (setq abbrev-file-name "~/.emacs.d/abbrev_defs")
  (setq save-abbrevs 'silent)
#+END_SRC

* undo tree

#+BEGIN_SRC emacs-lisp
  ;; https://elpa.gnu.org/packages/undo-tree.html
  ;; C-x u
  ;; C-_  (`undo-tree-undo') Undo changes.
  ;; M-_  (`undo-tree-redo') Redo changes.
  ;; (use-package undo-tree
  ;;   :ensure t
  ;;   :init
  ;;   (global-undo-tree-mode))
#+END_SRC

* misc packages

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure t
    :defer 5)

  (use-package toml-mode
    :ensure t
    :defer 5)

  (use-package markdown-mode
    :ensure t
    :defer 5)

  (use-package json-mode
    :ensure t
    :defer 5)
#+END_SRC
* avy
[[https://github.com/abo-abo/avy][avy]]

#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind
    (
     ;; ("s-c" . 'avy-goto-char-2)
     ("s-c" . 'avy-goto-word-1)
     ))
#+END_SRC

* Highlights matching parenthesis

#+BEGIN_SRC emacs-lisp
  ;; https://github.com/tarsius/paren-face
  (use-package paren-face
    :ensure t
    :config
    (setq show-paren-delay 0)
    (show-paren-mode 1)
    (set-face-background 'show-paren-match (face-background 'default))
    (set-face-foreground 'show-paren-match "red")
    ;; (set-face-attribute 'show-paren-match nil :strike-through t :weight 'extra-bold)
    )
#+END_SRC

* whitespace cleanup

#+BEGIN_SRC emacs-lisp
  ;;;; trailing whitespace
  ;; https://stackoverflow.com/questions/34531831/highlighting-trailing-whitespace-in-emacs-without-changing-character
  ;; (setq-default show-trailing-whitespace t)

  ;; https://www.gnu.org/software/emacs/manual/html_node/emacs/Useless-Whitespace.html
  ;; (global-whitespace-mode)

  (use-package whitespace-cleanup-mode
    :ensure t
    :bind (("C-c C-SPC". 'whitespace-cleanup))
    :hook
    (('prog-mode . 'whitespace-cleanup-mode)
     ('before-save . 'whitespace-cleanup)))
#+END_SRC
* pdf-tools

[[https://github.com/politza/pdf-tools][pdf-tools]]

** keys

#+caption: Navigation
| content                                    | key               |
|--------------------------------------------+-------------------|
| Scroll Up / Down by page-full              | space / backspace |
| Scroll Up / Down by line                   | C-n / C-p         |
| Scroll Right / Left                        | C-f / C-b         |
| Top of Page / Bottom of Page               | < / >             |
| Next Page / Previous Page                  | n / p             |
| First Page / Last Page                     | M-< / M->         |
| Incremental Search Forward / Backward      | C-s / C-r         |
| Occur (list all lines containing a phrase) | M-s o             |
| Pick a Link and Jump                       | F                 |
| Incremental Search in Links                | f                 |
| History Back / Forwards                    | B / N             |
| Display Outline                            | o                 |
| Jump to Page                               | M-g g             |

#+caption: Display
| content                                  | key       |
|------------------------------------------+-----------|
| Zoom in / Zoom out                       | + / -     |
| Fit Height / Fit Width / Fit Page        | H / W / P |
| Trim margins (set slice to bounding box) | s b       |
| Reset margins                            | s r       |
| Reset Zoom                               | 0         |

** config

#+BEGIN_SRC emacs-lisp
  ;; (use-package tablist
  ;;   :ensure t
  ;;   :defer 5)

  ;; (use-package pdf-tools
  ;;   :ensure t
  ;;   :defer 5
  ;;   :config
  ;;   (pdf-loader-install))

#+END_SRC
* google this

#+BEGIN_SRC emacs-lisp
  (use-package google-this
    :ensure t
    :defer 5)

  (global-set-key (kbd "C-x /") 'google-this-mode-submap)
#+END_SRC

* fci fill-column-indicator

|-------+-----------------|
| C-x f | set-fill-column |
| M-q   | fill-paragraph  |

#+BEGIN_SRC emacs-lisp
  (use-package fill-column-indicator
    :ensure t
    ;; :hook
    ;; (('prog-mode . 'fci-mode))
    :config
    ;; (require 'fill-column-indicator)
    (setq fci-rule-column 80))

  (global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC
* ispell

| i | in ispell proc, insert to private dictionary |


#+BEGIN_SRC emacs-lisp
  ;; (setq ispell-personal-dictionary "~/.emacs.d/ispell_dicts")
  ;; (global-set-key (kbd "M-$")   'ispell-word)
  ;; (global-set-key (kbd "C-M-i") 'ispell-complete-word)
#+END_SRC
* replace

** unconditional replace

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-r") 'replace-string)
#+END_SRC

** query replace

~M-%~

| y or space | Replace text and find the next occurrence      |
| n or del   | Leave text as is and find the next occurrence  |
| .          | Replace text then stop looking for occurrences |
| q or RET   | exit                                           |
| !          | Replace all occurrences without asking         |
| ^          | Return the cursor to previously replaced text  |
| u          | to undo previous replacement                   |
| U          | to undo all replacements                       |
| E          | to edit the replacement string                 |
* macros

|--------------------+-----------------------------|
| C-x C-k            | kmacro prefix               |
|--------------------+-----------------------------|
| C-x (              | start kmacro                |
| C-x )              | end kmacro                  |
| C-x e              | call last kmacro            |
|--------------------+-----------------------------|
| C-x C-k n          | name-last-kbd-macro         |
| m-x the-macro-name | exec the kmacro by name     |
| C-x C-k r          | apply-macro-to-region-lines |
| C-x C-k b          | kmacro-bind-to-key          |
|--------------------+-----------------------------|

