conf/conf.el
  ;; (("C-c l"   . 'org-store-link)
  ;;  ("C-c a"   . 'org-agenda)
  ;;  ("C-c b"   . 'org-switchb)
  ;;  ("C-c c"   . 'org-capture)
  ;;  ("C-x n f" . 'my/org-narrow-forward)
  ;;  ("C-x n b" . 'my/org-narrow-backward)
  ;;  ("C-c M-." . 'org-open-at-point)
  ;;  ("C-c M-," . 'org-mark-ring-goto))

  :config
  ;; (org-babel-do-load-languages
  ;;  'org-babel-load-languages
  ;;  '((restclient . t)
  ;;    (clojure    . t)
  ;;    (python     . t)
  ;;    (latex      . t)
  ;;    (shell      . t)))

  (setq org-startup-truncated nil)
  ;; (setq org-link-frame-setup '((file . find-file)))
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
  (setq org-html-checkbox-type 'html)
  (setq org-log-done 'time)
  (setq org-hide-emphasis-markers t)
  (setq org-image-actual-width nil)
  (setq org-default-notes-file "~/.emacs.d/notes.org")
  (setq org-todo-keywords
        '((sequence "TODO" "DOING" "|" "DONE" "CANCEL"))))

;; (use-package org-bullets
;;   :ensure t
;;   :defer 5
;;   :hook ('org-mode . 'org-bullets-mode)
;;   ;; :config
;;   ;; (setq org-bullets-bullet-list '("⓪" "①" "②" "③" "④" "⑤" "⑥" "⑦" "⑧" "⑨"))
;;   :after org)

;; (use-package htmlize
;;   :ensure t
;;   :defer 5
;;   :after org)

;; (use-package toc-org
;;   :ensure t
;;   :defer 5
;;   :after org
;;   :hook ('org-mode . 'toc-org-mode))

;; (use-package ox-gfm
;;   :ensure t
;;   :defer 5
;;   :after org)

;; ;; https://github.com/yjwen/org-reveal
;; ;;
;; ;; Available themes can be found in “css/theme/” in the reveal.js directory. black|league|night|simple|solarized|beige|blood|moon|serif|sky|white
;; ;; Available transitions are: default|cube|page|concave|zoom|linear|fade|none.
;; (use-package ox-reveal
;;   :ensure t
;;   :defer 5
;;   :after org
;;   :config
;;   (setq org-reveal-mathjax t)
;;   (setq org-reveal-root "https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.8.0/")
;;   ;; (setq org-reveal-root "/home/yuanbo/workspace/github.com/reveal.js")
;;   )
;; config:1 ends here

;; [[file:conf.org::*abbrev][abbrev:1]]
(setq-default abbrev-mode t)
(setq abbrev-file-name "~/.emacs.d/abbrev_defs")
(setq save-abbrevs 'silent)
;; abbrev:1 ends here

;; [[file:conf.org::*undo tree][undo tree:1]]
;; https://elpa.gnu.org/packages/undo-tree.html
;; C-x u
;; C-_  (`undo-tree-undo') Undo changes.
;; M-_  (`undo-tree-redo') Redo changes.
;; (use-package undo-tree
;;   :ensure t
;;   :init
;;   (global-undo-tree-mode))
;; undo tree:1 ends here

;; [[file:conf.org::*misc packages][misc packages:1]]
(use-package yaml-mode
  :ensure t
  :defer 5)

(use-package toml-mode
  :ensure t
  :defer 5)

(use-package markdown-mode
  :ensure t
  :defer 5)

(use-package json-mode
  :ensure t
  :defer 5)
;; misc packages:1 ends here

;; [[file:conf.org::*avy][avy:1]]
(use-package avy
  :ensure t
  :bind
  (
   ;; ("s-c" . 'avy-goto-char-2)
   ("s-c" . 'avy-goto-word-1)
   ))
;; avy:1 ends here

;; [[file:conf.org::*Highlights matching parenthesis][Highlights matching parenthesis:1]]
;; https://github.com/tarsius/paren-face
(use-package paren-face
  :ensure t
  :config
  (setq show-paren-delay 0)
  (show-paren-mode 1)
  (set-face-background 'show-paren-match (face-background 'default))
  (set-face-foreground 'show-paren-match "red")
  ;; (set-face-attribute 'show-paren-match nil :strike-through t :weight 'extra-bold)
  )
;; Highlights matching parenthesis:1 ends here

;; [[file:conf.org::*whitespace cleanup][whitespace cleanup:1]]
;;;; trailing whitespace
;; https://stackoverflow.com/questions/34531831/highlighting-trailing-whitespace-in-emacs-without-changing-character
;; (setq-default show-trailing-whitespace t)

;; https://www.gnu.org/software/emacs/manual/html_node/emacs/Useless-Whitespace.html
;; (global-whitespace-mode)

(use-package whitespace-cleanup-mode
  :ensure t
  :bind (("C-c C-SPC". 'whitespace-cleanup))
  :hook
  (('prog-mode . 'whitespace-cleanup-mode)
   ('before-save . 'whitespace-cleanup)))
;; whitespace cleanup:1 ends here

;; [[file:conf.org::*config][config:1]]
;; (use-package tablist
;;   :ensure t
;;   :defer 5)

;; (use-package pdf-tools
;;   :ensure t
;;   :defer 5
;;   :config
;;   (pdf-loader-install))
;; config:1 ends here

;; [[file:conf.org::*google this][google this:1]]
(use-package google-this
  :ensure t
  :defer 5)

(global-set-key (kbd "C-x /") 'google-this-mode-submap)
;; google this:1 ends here

;; [[file:conf.org::*fci fill-column-indicator][fci fill-column-indicator:1]]
(use-package fill-column-indicator
  :ensure t
  ;; :hook
  ;; (('prog-mode . 'fci-mode))
  :config
  ;; (require 'fill-column-indicator)
  (setq fci-rule-column 80))

(global-set-key (kbd "C-c q") 'auto-fill-mode)
;; fci fill-column-indicator:1 ends here

;; [[file:conf.org::*ispell][ispell:1]]
;; (setq ispell-personal-dictionary "~/.emacs.d/ispell_dicts")
;; (global-set-key (kbd "M-$")   'ispell-word)
;; (global-set-key (kbd "C-M-i") 'ispell-complete-word)
;; ispell:1 ends here

;; [[file:conf.org::*unconditional replace][unconditional replace:1]]
(global-set-key (kbd "C-r") 'replace-string)
;; unconditional replace:1 ends here
