conf/conf.org
* mark ring

| C-Space C-Space | to push current position into mark ring                            |
| C-u C-Space     | Move cursor to previous marked position in current buffer          |
| C-x C-Space     | Move cursor to previous marked position (may be in another buffer) |
| C-x C-x         | Move cursor to the other end of selection                          |

* transpose

| transpose char  | Ctrl+t        |
| transpose word  | Meta+t        |
| transpose line  | Ctrl+x Ctrl+t |
| transpose sexps | Ctrl+Meta+t   |

* buffer move

#+BEGIN_SRC emacs-lisp
  (use-package buffer-move
    :ensure t
    :defer 5)

  (global-set-key (kbd "<C-S-up>")     'buf-move-up)
  (global-set-key (kbd "<C-S-down>")   'buf-move-down)
  (global-set-key (kbd "<C-S-left>")   'buf-move-left)
  (global-set-key (kbd "<C-S-right>")  'buf-move-right)
#+END_SRC

* dired

| C-x C-q | edit               |
| t       | toggle mark        |
| u/U     | unmark/ unmark all |
| m       | mark               |
| d       | mark to delete     |
| D       | delete             |
| C       | copy               |
| R       | move, rename       |
| ~^~       | parent dir         |
| +       | create dir         |
| *-/     | mark all dirs      |
| s       | sort               |
| C-o     | display file       |
| ~!~       | do shell command   |
|         |                    |

* command log

| Alt+x | global-command-log-mode (optional. Turn on logging for any buffer) |
| Alt+x | clm/open-command-log-buffer (show the key/command output buffer)   |

#+BEGIN_SRC emacs-lisp
  ;; (use-package command-log-mode
  ;;   :ensure t)
#+END_SRC

* window enlarge

#+BEGIN_SRC emacs-lisp
  ;; C-x + (balance-windows) to make windows the same heights and widths.

  ;; enlarge window vertically
  ;; (global-set-key (kbd "C-c ^") (kbd "C-u - 20 C-x ^"))
  ;; (global-set-key (kbd "C-c C-6") )

  ;; enlarge window horizontally
  ;; (global-set-key (kbd "C-c }") (kbd "C-u - 20 C-x }"))
  ;; (global-set-key (kbd "C-c {") (kbd "C-u - 20 C-x {"))


  (global-set-key (kbd "S-C-<left>")  'shrink-window-horizontally)
  (global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
  (global-set-key (kbd "S-C-<down>")  'shrink-window)
  (global-set-key (kbd "S-C-<up>")    'enlarge-window)
#+END_SRC

* bookmarks

| C-x r m | Set a bookmark   |
| C-x r l | List bookmarks   |
| C-x r b | Jump to bookmark |

* Occur and highlight

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c o") 'occur)
#+END_SRC

| M-s o           | List lines matching a pattern        |
| M-x flush-lines | Flushes lines matching a pattern     |
| M-x keep-lines  | Keeps only lines matching a pattern  |
|-----------------+--------------------------------------|
| M-s h p         | Highlights a phrase                  |
| M-s h r         | Highlights a regular expression      |
| M-s h .         | Highlights symbol at the point       |
| M-s h u         | Removes highlighting under the point |

* dashboard

| Shortcut                   | Function         |
|----------------------------+------------------|
| Tab Or C-i                 | Next Item        |
| Shift-Tab                  | Previous Item    |
| Return / Mouse Click / C-m | Open             |
| r                          | Recent files     |
| m                          | Bookmarks        |
| p                          | Projects         |
| a                          | Org-Mode Agenda  |
| e                          | Registers        |
| g                          | Refresh contents |
| {                          | Previous section |
| }                          | Next section     |

#+BEGIN_SRC emacs-lisp
  ;; (use-package dashboard
  ;;   :ensure t
  ;;   :config
  ;;   (dashboard-setup-startup-hook)

  ;;   (setq dashboard-startup-banner 'official)
  ;;   (setq dashboard-banner-logo-title "Welcome to Emacs")
  ;;   (setq dashboard-center-content t)
  ;;   (setq dashboard-show-shortcuts nil)
  ;;   (setq dashboard-set-init-info t)

  ;;   (setq dashboard-items '((recents  . 5)
  ;;                           (projects . 5))))
#+END_SRC
* browse url
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c b") 'browse-url)
#+end_src

* elfeed

** overview

rss feed in Emacs

https://github.com/skeeto/elfeed
https://lucidmanager.org/productivity/read-rss-feeds-with-emacs-and-elfeed/

** shortcuts
** Here are some example filters.

*** @6-months-ago +unread
Only show unread entries of the last six months. This is the default filter.

*** linu[xs] @1-year-old
Only show entries about Linux or Linus from the last year.

*** -unread +youtube #10
Only show the most recent 10 previously-read entries tagged as youtube.

*** +unread !x?emacs
Only show unread entries not having emacs or xemacs in the title or link.

*** +emacs =http://example.org/feed/
Only show entries tagged as emacs from a specific feed.

#+begin_src elisp
  (use-package elfeed
    :ensure t
    :defer 5
    :bind (("C-x w" . 'elfeed))
    :config
    ;; (setq-default elfeed-search-filter "@1-week-ago +unread ")

    (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
          elfeed-show-entry-switch 'display-buffer)

    (setq elfeed-feeds
          '("https://tdodge.consulting/blog/rss.xml")))
#+end_src

* tab bar
tab-bar-show tab-next, tab-switcher tab-new, tab-close

The prefix key C-x t

#+begin_src emacs-lisp
  ;; (use-package tabbar
  ;;     :ensure t
  ;;     :defer 5
  ;;     :config
  ;;     (setq tab-bar-show t)
  ;;     (setq tab-bar-tab-hints t))
#+end_src

