conf/conf.el

;; [[file:conf.org::*buffer move][buffer move:1]]
(use-package buffer-move
  :ensure t
  :defer 5)

(global-set-key (kbd "<C-S-up>")     'buf-move-up)
(global-set-key (kbd "<C-S-down>")   'buf-move-down)
(global-set-key (kbd "<C-S-left>")   'buf-move-left)
(global-set-key (kbd "<C-S-right>")  'buf-move-right)
;; buffer move:1 ends here

;; [[file:conf.org::*command log][command log:1]]
;; (use-package command-log-mode
;;   :ensure t)
;; command log:1 ends here

;; [[file:conf.org::*window enlarge][window enlarge:1]]
;; C-x + (balance-windows) to make windows the same heights and widths.

;; enlarge window vertically
;; (global-set-key (kbd "C-c ^") (kbd "C-u - 20 C-x ^"))
;; (global-set-key (kbd "C-c C-6") )

;; enlarge window horizontally
;; (global-set-key (kbd "C-c }") (kbd "C-u - 20 C-x }"))
;; (global-set-key (kbd "C-c {") (kbd "C-u - 20 C-x {"))


(global-set-key (kbd "S-C-<left>")  'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>")  'shrink-window)
(global-set-key (kbd "S-C-<up>")    'enlarge-window)
;; window enlarge:1 ends here

;; [[file:conf.org::*Occur and highlight][Occur and highlight:1]]
(global-set-key (kbd "C-c o") 'occur)
;; Occur and highlight:1 ends here

;; [[file:conf.org::*dashboard][dashboard:1]]
;; (use-package dashboard
;;   :ensure t
;;   :config
;;   (dashboard-setup-startup-hook)

;;   (setq dashboard-startup-banner 'official)
;;   (setq dashboard-banner-logo-title "Welcome to Emacs")
;;   (setq dashboard-center-content t)
;;   (setq dashboard-show-shortcuts nil)
;;   (setq dashboard-set-init-info t)

;;   (setq dashboard-items '((recents  . 5)
;;                           (projects . 5))))
;; dashboard:1 ends here

;; [[file:conf.org::*browse url][browse url:1]]
(global-set-key (kbd "C-c b") 'browse-url)
;; browse url:1 ends here

;; [[file:conf.org::*+emacs =http:/example.org/feed/][+emacs =http://example.org/feed/:1]]
(use-package elfeed
  :ensure t
  :defer 5
  :bind (("C-x w" . 'elfeed))
  :config
  ;; (setq-default elfeed-search-filter "@1-week-ago +unread ")

  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
        elfeed-show-entry-switch 'display-buffer)

  (setq elfeed-feeds
        '("https://tdodge.consulting/blog/rss.xml")))
;; +emacs =http://example.org/feed/:1 ends here

;; [[file:conf.org::*tab bar][tab bar:1]]
;; (use-package tabbar
;;     :ensure t
;;     :defer 5
;;     :config
;;     (setq tab-bar-show t)
;;     (setq tab-bar-tab-hints t))
;; tab bar:1 ends here
